/**
 *  wwh 表单校验基础数据
 * Created by Administrator on 2015/8/24.
 */
var regExType =
{
    number:"^\\d*$",//数字
    integer:"^-?[1-9]\\d*$",					//整数
    positiveInteger:"^[1-9]\\d*$",					//正整数
    negtiveInteger:"^-[1-9]\\d*$",					//负整数
    digit:"^([+-]?)\\d*\\.?\\d+$",			//数字
    positive:"^[1-9]\\d*$|0$",					//正数（正整数 + 0）
    negtive:"^-[1-9]\\d*$|0$",					//负数（负整数 + 0）
    positiveNoZero:"^[1-9]\\d*$",					//正数（正整数）
    bigZeroDigit:"^(?:[1-9][0-9]*(?:\.[0-9]+)?|0\.(?!0+$)[0-9]+)$",     // 大于零的所有数字
    digitOrDecmal:"^[1-9]\\d*|0|[1-9]\\d*.\\d*|0.\\d*[1-9]\\d*$",	// 正数或者正浮点数
    decmal:"^([+-]?)\\d*\\.\\d+$",			//浮点数
    positiveDecmal:"^[1-9]\\d*.\\d*|0.\\d*[1-9]\\d*$",　　	//正浮点数
    negtiveDecmal:"^-([1-9]\\d*.\\d*|0.\\d*[1-9]\\d*)$",　 //负浮点数
    decmals:"^-?([1-9]\\d*.\\d*|0.\\d*[1-9]\\d*|0?.0+|0)$",　 //浮点数
    positiveDecmals:"^[1-9]\\d*.\\d*|0.\\d*[1-9]\\d*|0?.0+|0$",　　 //非负浮点数（正浮点数 + 0）
    negtiveDecmals:"^(-([1-9]\\d*.\\d*|0.\\d*[1-9]\\d*))|0?.0+|0$",　　//非正浮点数（负浮点数 + 0）
    email:"^([a-zA-Z0-9]+[\-|_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[\-|\_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}?$", //邮件
    color:"^[a-fA-F0-9]{6}$",				//颜色
    url:"^http[s]?:\\/\\/([\\w-]+\\.)+[\\w-]+([\\w-./?%&=]*)?$",	//url
    china:"^[\\u4E00-\\u9FA5\\uF900-\\uFA2D]+$",					//仅中文
    ascii:"^[\\x00-\\xFF]+$",				//仅ACSII字符
    zipCode:"^\\d{6}$",						//邮编
    mobile:"^(13[0123456789][0-9]{8}|15[012356789][0-9]{8}|18[0123456789][0-9]{8}|17[678][0-9]{8}|170[059][0-9]{7}|14[57][0-9]{8})$",				//手机
    ip:"^(25[0-5]|2[0-4]\\d|[0-1]\\d{2}|[1-9]?\\d)\\.(25[0-5]|2[0-4]\\d|[0-1]\\d{2}|[1-9]?\\d)\\.(25[0-5]|2[0-4]\\d|[0-1]\\d{2}|[1-9]?\\d)\\.(25[0-5]|2[0-4]\\d|[0-1]\\d{2}|[1-9]?\\d)$",	//ip地址
    picture:"(.*)\\.(jpg|bmp|gif|ico|pcx|jpeg|tif|png|raw|tga)$",	//图片
    rar:"(.*)\\.(rar|zip|7zip|tgz)$",								//压缩文件
    date:"^\\d{4}(\\-|\\/|\.)\\d{1,2}\\1\\d{1,2}$",					//日期
    qq:"^[1-9]*[1-9][0-9]*$",				//QQ号码
    tel:"(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}",	//电话号码的函数(包括验证国内区号,国际区号,分机号)
    stringComposition:"^(?=.*[0-9].*)(?=.*[A-Z].*)(?=.*[a-z].*).{10,}$",//必须由数字、大小写字母、10位组成
    userName:"^[a-zA-Z][a-zA-Z_0-9][0-9_a-zA-Z]{0,}$",//用来用户注册。匹配由数字、26个英文字母或者下划线组成的字符串
    addUserName:"[a-zA-Z][a-zA-Z(@|_)0-9][0-9(@|_)a-zA-Z]{0,}$",////用来用户注册。匹配由数字、26个英文字母或者下划线组成的字符串
    english:"^[A-Za-z]+$",					//字母
    bigEnglish:"^[A-Z]+$",					//大写字母
    smallEnglish:"^[a-z]+$",					//小写字母
    idCard:"(^\\d{15}$)|(^\\d{18}$)|(^\\d{17}(\\d|X|x)$)",	//身份证
    digitOrEnglish:"^[A-Za-z0-9]+$",    //数字和字母
    chinaOrEnglish:"^[\\u4e00-\\u9fa5a-zA-Z]+$",  //汉字和字母
    cEDigit:"^[a-zA-Z0-9\\u4e00-\\u9fa5（）()]+$", //汉字,字母,数字,括号
    digtOrEglsOrspecial:"^[A-Za-z0-9`~!@#$%^&*()_+=\-|{}':;'"+'"'+",\\[\\].<>/?~·！@#￥……&*（）——|{}【】’‘；：”“'。，、？\\《》]+$" ,//数字、字母、特殊字符
    special:"^[`~!@#$%^&*()_+=\-|{}':;'"+'"'+",\\[\\].<>/?~·！@#￥……&*（）——|{}【】’‘；：”“'。，、？\\《》]+$" ,//特殊字符
    specials:"[`~!@#$%^&*()_+=\-|{}':;'"+'"'+",\\[\\].<>/?~·！@#￥……&*（）——|{}【】’‘；：”“'。，、？\\《》]" ,//密码强度检查特殊字符
    loginNmae:"^[a-zA-Z][a-zA-Z0-9_]{0,}|([a-zA-Z0-9]+[\-|_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[\-|\_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}?|(13[0123456789][0-9]{8}|15[012356789][0-9]{8}|18[0123456789][0-9]{8}|17[678][0-9]{8}|170[059][0-9]{7}|14[57][0-9]{8})$" ,//登陆名
    moblieName:"^([\\u4e00-\\u9fa5a-zA-Z.]+\s?)*[\\u4e00-\\u9fa5a-zA-Z.]$" ,//汉字和字母y、圆点、空格(中间只能有一个空格)
    taiwanCard:"^[A-Za-z0-9()]{8,8}$|^[A-Za-z0-9()]{10,10}$|^[A-Za-z0-9()]{13,13}$" ,//台胞证规则
    HKMCard:"^[HM][0-9]{0,10}$" ,//港澳通行证
    regAmount:"^(-?\\d+)$|(-?\\d+\.)(\\d+)?$"/*金额输入*/
};
//去除前后空格
function goBlank(str)
{
    return str.replace(/(^\s*)|(\s*$)/g, "");
}

var aCityVal={11:"北京",12:"天津",13:"河北",14:"山西",15:"内蒙古",21:"辽宁",22:"吉林",23:"黑龙江",31:"上海",32:"江苏",33:"浙江",34:"安徽",35:"福建",36:"江西",37:"山东",41:"河南",42:"湖北",43:"湖南",44:"广东",45:"广西",46:"海南",50:"重庆",51:"四川",52:"贵州",53:"云南",54:"西藏",61:"陕西",62:"甘肃",63:"青海",64:"宁夏",65:"新疆",71:"台湾",81:"香港",82:"澳门",91:"国外"}

function isCardID(sId){
    var iSum=0 ;
    var info="" ;
    if(!/^\d{17}(\d|x)$/i.test(sId)) return "你输入的身份证长度或格式错误";
    sId=sId.replace(/x$/i,"a");
    if(aCityVal[parseInt(sId.substr(0,2))]==null) return "你的身份证地区非法";
    sBirthday=sId.substr(6,4)+"-"+Number(sId.substr(10,2))+"-"+Number(sId.substr(12,2));
    var d=new Date(sBirthday.replace(/-/g,"/"));
    if(sBirthday!=(d.getFullYear()+"-"+ (d.getMonth()+1) + "-" + d.getDate()))return "身份证上的出生日期非法";
    for(var i = 17;i>=0;i --) iSum += (Math.pow(2,i) % 11) * parseInt(sId.charAt(17 - i),11) ;
    if(iSum%11!=1) return "你输入的身份证号非法";
    return true;//aCityVal[parseInt(sId.substr(0,2))]+","+sBirthday+","+(sId.substr(16,1)%2?"男":"女")
}

//短时间，形如 (13:04:06)
function isTime(str)
{
    var a = str.match(/^(\d{1,2})(:)?(\d{1,2})\2(\d{1,2})$/);
    if (a == null) {return false}
    if (a[1]>24 || a[3]>60 || a[4]>60)
    {
        return false;
    }
    return true;
}

//短日期，形如 (2003-12-05)
function isDate(str)
{
    var r = str.match(/^(\d{1,4})(-|\/)(\d{1,2})\2(\d{1,2})$/);
    if(r==null)return false;
    var d= new Date(r[1], r[3]-1, r[4]);
    return (d.getFullYear()==r[1]&&(d.getMonth()+1)==r[3]&&d.getDate()==r[4]);
}

//长时间，形如 (2003-12-05 13:04:06)
function isDateTime(str)
{
    var reg = /^(\d{1,4})(-|\/)(\d{1,2})\2(\d{1,2}) (\d{1,2}):(\d{1,2}):(\d{1,2})$/;
    var r = str.match(reg);
    if(r==null) return false;
    var d= new Date(r[1], r[3]-1,r[4],r[5],r[6],r[7]);
    return (d.getFullYear()==r[1]&&(d.getMonth()+1)==r[3]&&d.getDate()==r[4]&&d.getHours()==r[5]&&d.getMinutes()==r[6]&&d.getSeconds()==r[7]);
}

